Repository: oxunov713/maydon_go
Catalog: lib/src/common/l10n/app_*.arb
Languages: uz

source: Choose language
uz: Tilni tanlang

source: Uzbek
uz: O'zbek

source: Russian
uz: Rus

source: English
uz: Ingliz

# continueBt
source: Continue
uz: Davom etish

# roleUserTitle
source: Find a Field
uz: Maydonni topish

# roleUserSubTitle
source: I want to search for a field
uz: Maydonni qidirmoqchiman

# roleOwnerTitle
source: Enter a Field
uz: Maydonni kiritish

# roleOwnerSubTitle
source: I want to enter a field
uz: Maydonni kiritmoqchiman

source: Sign Up
uz: Ro'yxatdan o'tish

source: Login
uz: Kirish

source: First Name
uz: Ism

source: Last Name
uz: Familiya

# phone
source: Phone number
uz: Telefon raqam

source: Password
uz: Parol

source: Confirm Password
uz: Parolni qayta kiriting

# signupSuccess
source: Signup Successful!
uz: Ro'yxatdan o'tish muvaffaqiyatli!

# phoneFormatError
source: Please enter a valid phone number format.
uz: Iltimos, telefon raqamining to'g'ri formatini kiriting.

# passwordMinLengthError
source: Password must be at least 6 characters long!
uz: Parol kamida 6 ta belgidan iborat bo'lishi kerak!

# passwordMatchError
source: Passwords must match!
uz: Parollar mos kelishi kerak!

# firstNameError
source: Please enter your first name!
uz: Iltimos, ismingizni kiriting!

# lastNameError
source: Please enter your last name!
uz: Iltimos, familiyangizni kiriting!

# phoneError
source: Please enter your phone number!
uz: Iltimos, raqamingizni kiriting!

# passwordError
source: Please create a password
uz: Iltimos, parol yarating

# confirmPasswordError
source: Please confirm your password!
uz: Yaratgan parolingizni qayta kiriting!

source: Signup in progress...
uz: Ro'yxatdan o'tish davom etmoqda...

# signupButtonText
source: Sign Up
uz: Ro'yxatdan o'tish

# loginPasswordEmpty
source: Please enter the password
uz: Iltimos, parol kiriting

# otp_verification_title
source: OTP Verification
uz: OTP kodini tekshirish

# otp_verification_subtitle
source: We sent an OTP code to your phone number --- --- ---99. Enter the OTP code below to continue.
uz: Biz telefon raqamingizga OTP kodini yubordik --- --- ---{last2numbers}. Davomi ostidagi OTP kodini kiriting davom etish uchun.

# otp_verification_resend_timer
source: You can resend the code in {remaining_seconds} seconds
uz: Sizga kodni {remaining_seconds} soniyada qayta yuboramiz

# otp_verification_button
source: Verify
uz: Tasdiqlash

# forgot_password
source: Forgot your password?
uz: Parolni unutdingizmi?

source: Resend Code
uz: Qayta yuborish

source: Stadiums
uz: Stadionlar

source: Saved
uz: Saqlanganlar

source: Profile
uz: Profil

source: All stadiums
uz: Barcha maydonlar

# search_placeholder
source: Stadium name
uz: Maydon nomi

source: Rating
uz: Reyting

source: Price
uz: Narx

# empty_slots
source: Today's available slots
uz: Bugungi bo'sh vaqtlar

# all_slots_booked
source: All slots are booked
uz: Barcha soatlar band

source: Location
uz: Manzil

# noData
source: No data available
uz: Ma'lumot mavjud emas

# appTitle
source: Fields
uz: Maydonlar

source: No fields found
uz: Maydonlar topilmadi

source: Add field
uz: Maydon qo'shish

# dataLoadError
source: Failed to load data
uz: Ma'lumotlarni yuklab bo'lmadi

source: Retry
uz: Qayta urinish

source: Booked
uz: Band qilingan

source: Available
uz: Bo'sh

source: Manage
uz: Boshqarish

source: Unknown field
uz: Noma'lum maydon

# addStadiumTitle
source: Add Stadium
uz: Stadion qo'shish

# stadiumAddedSuccess
source: Stadium added successfully!
uz: Stadion muvaffaqiyatli qo'shildi!

# nameLabel
source: Name
uz: Nomi

# nameHint
source: e.g., Novza Stadium
uz: masalan: Novza stadioni

# nameRequired
source: Name is required
uz: Nomi kiritilishi shart

# descriptionLabel
source: Description
uz: Tavsif

# descriptionHint
source: e.g., A stadium with all amenities
uz: masalan: Barcha qulayliklar ega stadion

# descriptionRequired
source: Description is required
uz: Tavsif kiritilishi shart

# priceLabel
source: Price
uz: Narxi

# priceHint
source: e.g., 200,000 UZS
uz: masalan: 200 000 so'm

# priceRequired
source: Price is required
uz: Narxi kiritilishi shart

# stadiumCountLabel
source: Stadium count
uz: Stadionlar soni

# stadiumCountHint
source: e.g., Number of side-by-side stadiums
uz: masalan: Yonma-yon stadionlar soni

# stadiumCountRequired
source: Count must be greater than 0
uz: Son 0 dan katta bo'lishi kerak

# selectLocation
source: Select Location from Google Maps
uz: Google Xaritalardan joy tanlash

# hasUniforms
source: Uniforms available?
uz: Forma mavjudmi?

# hasBathroom
source: Bathroom available?
uz: Dush mavjudmi?

# isIndoor
source: Indoor stadium available?
uz: Yopiq stadion mavjudmi?

source: Submit
uz: Yuborish

source: Submitting...
uz: Yuborilmoqda...

# bookingListTitle
source: Booking List
uz: Bronlar ro'yxati

source: No bookings available
uz: Bronlar mavjud emas

# errorOccurred
source: An error occurred
uz: Xatolik yuz berdi

source: Unknown stadium
uz: Noma'lum stadion

source: No name available
uz: Ism mavjud emas

source: Call
uz: Qo'ng'iroq qilish

source: Close
uz: Yopish

# selectLocationTitle
source: Select Location
uz: Joy tanlash

source: Confirm Location
uz: Joyni tasdiqlash

source: Current Location
uz: Hozirgi joy

source: Loading location...
uz: Joy yuklanmoqda...

# locationError
source: Failed to load location
uz: Joyni yuklab boâ€˜lmadi

# bookingsLabel
source: Bookings
uz: Bronlar

# profileLabel
source: Profile
uz: Profil

# profileTitle
source: Profile
uz: Profil

source: No name
uz: Ism yo'q

source: Notification
uz: Bildirishnoma

source: Subscription
uz: Obuna

source: Add image
uz: Rasm qo'shish

source: About app
uz: Ilova haqida

# imagesUploadedSuccess
source: Images uploaded successfully!
uz: Rasmlar muvaffaqiyatli yuklandi!

# imageUploadError
source: Error uploading images: {error}
uz: Rasmlarni yuklashda xatolik: {error}

source: No images selected
uz: Rasmlar tanlanmadi

source: Subscription Packages
uz: Obuna paketlari

source: Active
uz: Faol

source: Inactive
uz: Nofaol

# subscriptionSelected
source: You have selected the {price} subscription!
uz: Siz {price} obunasini tanladingiz!

# errorLoading
source: Error loading subscriptions
uz: Obunalarni yuklashda xatolik

source: Loading...
uz: Yuklanmoqda...

# noBookings
source: No bookings available on the selected day
uz: Tanlangan kunda bronlar mavjud emas

source: Client
uz: Mijoz

# bookingsTitle
source: Substadium Bookings
uz: Maydon bronlari
